In [5]:
import pandas as pd
import mod_sql

_db = mod_sql.Database()

In [7]:
## SQL에서 LIKE구문 사용시 %s 와 같은 형태로 S로 끝이 나는 값을 출력을 하지만 
## LIKE구문은 뒤에 단어가 나온다던지 끝에 ~로 끝나는 단어로 표시
## Python에서 특수문자 %를 사용하기 때문에 %%로 표기해야 함
## 파이썬에서는 %%를 두번 적어야 퍼센트로 인식함

sql = """
SELECT * FROM emp WHERE ENAME LIKE '%%S'
"""

_db.executeAll(sql)

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL COMM  DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0           20
1   7876  ADAMS    CLERK  7788  1987-07-13  1100.0           20
2   7900  JAMES    CLERK  7698  1981-12-03   950.0           30

## 이중 쿼리문
1. 부서의 위치가 'New York','DALLAS'가 아닌 소속 사원들의 정보를 출력
2. 부서의 위치가 New York과 DALAS가 아닌 지역의 부서번호
3. 사원정보 테이블에서 위에서 찾은 부서 번호를 조건으로 사원 정보 테이블을 출력

In [ ]:
# JOIN함수 사용도 가능

In [23]:
#case 1  '='사용하기

sql= """ 
SELECT DEPTNO
FROM DEPT WHERE LOC != 'New York' and LOC != 'DALLAS'
"""

_db.executeAll(sql)

   DEPTNO
0      30
1      40

In [17]:
#case 1(ver.2)  'in'사용하기

sql= """ 
SELECT DEPTNO FROM dept WHERE LOC NOT IN ('New York','DALLAS')
"""

_db.executeAll(sql)

   DEPTNO
0      30
1      40

In [16]:
sql = """
SELECT * from emp WHERE DEPTNO IN(
    SELECT DEPTNO FROM dept WHERE LOC NOT IN ('New York','DALLAS')
)
"""

_db.executeAll(sql)

   EMPNO   ENAME       JOB   MGR    HIREDATE     SAL     COMM  DEPTNO
0   7499   ALLEN  SALESMAN  7698  1981-02-20  1600.0   300.00      30
1   7521    WARD  SALESMAN  7698  1981-02-22  1250.0   500.00      30
2   7654  MARTIN  SALESMAN  7698  1981-09-28  1250.0  1400.00      30
3   7698   BLAKE   MANAGER  7839  1981-05-01  2850.0               30
4   7844  TURNER  SALESMAN  7698  1981-09-08  1500.0     0.00      30
5   7900   JAMES     CLERK  7698  1981-12-03   950.0               30